cfe llm/Catalogs/AI_ПрофилиДоступаКДанным.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_ПрофилиДоступаКДанным</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьВыполнениеЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумШагов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумЗапросовКДанным</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумСтрокРезультата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлинаЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребоватьПериод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграниченныеПоля</Name>
					<Comment>Поля, которые агенту запрещено использовать в запросах. Пустой список разрешает все поля разрешенных объектов.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_ПолитикиАгента/Ext/Module.bsl
Функция Получить(Знач ПрофильДоступа) Экспорт

	Политика = ПолитикаПоУмолчанию();
	Если Не ЗначениеЗаполнено(ПрофильДоступа) Тогда
		Возврат Политика;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|    Профили.РазрешитьВыполнениеЗапросов КАК РазрешитьВыполнениеЗапросов,
		|    Профили.МаксимумШагов КАК МаксимумШагов,
		|    Профили.МаксимумЗапросовКДанным КАК МаксимумЗапросовКДанным,
		|    Профили.МаксимумСтрокРезультата КАК МаксимумСтрокРезультата,
		|    Профили.МаксимальнаяДлинаЗапроса КАК МаксимальнаяДлинаЗапроса
		|ИЗ
		|    Справочник.AI_ПрофилиДоступаКДанным КАК Профили
		|ГДЕ
		|    Профили.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    РазрешенныеОбъекты.ПолноеИмя КАК ПолноеИмя,
		|    РазрешенныеОбъекты.ТребоватьПериод КАК ТребоватьПериод
		|ИЗ
		|    Справочник.AI_ПрофилиДоступаКДанным.РазрешенныеОбъекты КАК РазрешенныеОбъекты
		|ГДЕ
		|    РазрешенныеОбъекты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ОграниченныеПоля.ПолноеИмяОбъекта КАК ПолноеИмяОбъекта,
		|    ОграниченныеПоля.ИмяПоля КАК ИмяПоля
		|ИЗ
		|    Справочник.AI_ПрофилиДоступаКДанным.ОграниченныеПоля КАК ОграниченныеПоля
		|ГДЕ
		|    ОграниченныеПоля.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ПрофильДоступа);

	Результаты = Запрос.ВыполнитьПакет();
	Выборка = Результаты[0].Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Политика;
	КонецЕсли;

	Политика.Профиль = ПрофильДоступа;
	Политика.РазрешитьВыполнениеЗапросов = Выборка.РазрешитьВыполнениеЗапросов;
	Политика.МаксимумШагов = НормализоватьЛимит(Выборка.МаксимумШагов, 6);
	Политика.МаксимумЗапросовКДанным = НормализоватьЛимит(Выборка.МаксимумЗапросовКДанным, 4);
	Политика.МаксимумСтрокРезультата = НормализоватьЛимит(Выборка.МаксимумСтрокРезультата, 100);
	Политика.МаксимальнаяДлинаЗапроса = НормализоватьЛимит(Выборка.МаксимальнаяДлинаЗапроса, 10000);

	ВыборкаОбъектов = Результаты[1].Выбрать();
	Пока ВыборкаОбъектов.Следующий() Цикл
		ПолноеИмя = СокрЛП(ВыборкаОбъектов.ПолноеИмя);
		Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда
			Продолжить;
		КонецЕсли;
		Настройка = Новый Структура(
			"ПолноеИмя,ТребоватьПериод",
			ПолноеИмя,
			ВыборкаОбъектов.ТребоватьПериод);
		Политика.РазрешенныеОбъекты.Вставить(НРег(ПолноеИмя), Настройка);
	КонецЦикла;

	ВыборкаПолей = Результаты[2].Выбрать();
	Пока ВыборкаПолей.Следующий() Цикл
		ПолноеИмяОбъекта = СокрЛП(ВыборкаПолей.ПолноеИмяОбъекта);
		ИмяПоля = СокрЛП(ВыборкаПолей.ИмяПоля);
		Если Не ЗначениеЗаполнено(ПолноеИмяОбъекта) Или Не ЗначениеЗаполнено(ИмяПоля) Тогда
			Продолжить;
		КонецЕсли;
		Ограничение = Новый Структура(
			"ПолноеИмяОбъекта,ИмяПоля",
			ПолноеИмяОбъекта,
			ИмяПоля);
		Политика.ОграниченныеПоля.Добавить(Ограничение);
	КонецЦикла;

	Возврат Политика;

КонецФункции

Функция ОбъектРазрешен(Знач Политика, Знач ПолноеИмя) Экспорт

	Если ОбъектСистемноЗапрещен(ПолноеИмя) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Политика.РазрешенныеОбъекты.Получить(НРег(СокрЛП(ПолноеИмя))) <> Неопределено;

КонецФункции

Функция НастройкаОбъекта(Знач Политика, Знач ПолноеИмя) Экспорт

	Если ОбъектСистемноЗапрещен(ПолноеИмя) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Политика.РазрешенныеОбъекты.Получить(НРег(СокрЛП(ПолноеИмя)));

КонецФункции

Функция ОбъектСистемноЗапрещен(Знач ПолноеИмя) Экспорт

	ИмяОбъекта = НРег(СокрЛП(Строка(ПолноеИмя)));
	ЗапрещенныеОбъекты = Новый Массив;
	ЗапрещенныеОбъекты.Добавить("регистрсведений.ai_диалоги");
	ЗапрещенныеОбъекты.Добавить("регистрсведений.ai_заголовкидиалогов");
	ЗапрещенныеОбъекты.Добавить("регистрсведений.ai_агентскиеоперации");
	ЗапрещенныеОбъекты.Добавить("регистрсведений.ai_шагиагентскихопераций");
	ЗапрещенныеОбъекты.Добавить("регистрсведений.ai_вложенияагентскихопераций");
	ЗапрещенныеОбъекты.Добавить("регистрсведений.ai_журналзапросов");
	ЗапрещенныеОбъекты.Добавить("регистрсведений.ai_секретыmcp");
	ЗапрещенныеОбъекты.Добавить("регистрсведений.ai_очередьзапросов");
	ЗапрещенныеОбъекты.Добавить("справочник.ai_вложениядиалогов");
	Возврат ЗапрещенныеОбъекты.Найти(ИмяОбъекта) <> Неопределено;

КонецФункции

Функция ПолеОграничено(Знач Политика, Знач ПолноеИмяОбъекта, Знач ИмяПоля) Экспорт

	ИскомыйОбъект = НРег(СокрЛП(Строка(ПолноеИмяОбъекта)));
	ИскомоеПоле = НРег(СокрЛП(Строка(ИмяПоля)));
	Для Каждого Ограничение Из Политика.ОграниченныеПоля Цикл
		Если НРег(СокрЛП(Ограничение.ПолноеИмяОбъекта)) = ИскомыйОбъект
				И НРег(СокрЛП(Ограничение.ИмяПоля)) = ИскомоеПоле Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ДоступныЗапросы(Знач Политика) Экспорт

	Возврат Политика.РазрешитьВыполнениеЗапросов
		И Политика.РазрешенныеОбъекты.Количество() > 0
		И (РольДоступна("AI_АнализДанныхАгентом") Или РольДоступна("AI_ПолныеПрава"));

КонецФункции

Функция ПолитикаПоУмолчанию()

	Политика = Новый Структура;
	Политика.Вставить("Профиль", Справочники.AI_ПрофилиДоступаКДанным.ПустаяСсылка());
	Политика.Вставить("РазрешитьВыполнениеЗапросов", Ложь);
	Политика.Вставить("МаксимумШагов", 6);
	Политика.Вставить("МаксимумЗапросовКДанным", 4);
	Политика.Вставить("МаксимумСтрокРезультата", 100);
	Политика.Вставить("МаксимальнаяДлинаЗапроса", 10000);
	Политика.Вставить("РазрешенныеОбъекты", Новый Соответствие);
	Политика.Вставить("ОграниченныеПоля", Новый Массив);
	Возврат Политика;

КонецФункции

Функция НормализоватьЛимит(Знач Значение, Знач ПоУмолчанию)

	Если ТипЗнч(Значение) <> Тип("Число") Или Значение <= 0 Тогда
		Возврат ПоУмолчанию;
	КонецЕсли;
	Возврат Цел(Значение);

КонецФункции
